data/Section 5/5.1/Clients/VM1_Instance2/rep2/output_C2_T1_W64_K6_R2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       38262 ops,     512 (avg:     425) ops/sec, 1.82MB/sec (avg: 1.51MB/sec),  3.89 (avg:  4.69) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         212.56          ---          ---      4.50700       220.74
Gets         212.56      1275.36         0.00      4.87100      1326.99
Waits          0.00          ---          ---      0.00000          ---
Totals       425.12      1275.36         0.00      4.68900      1547.73


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.500         0.03
SET       1.600         0.15
SET       1.700         0.62
SET       1.800         1.64
SET       1.900         3.43
SET       2.000         5.96
SET       2.100         9.03
SET       2.200        12.78
SET       2.300        16.50
SET       2.400        20.53
SET       2.500        24.14
SET       2.600        27.53
SET       2.700        30.55
SET       2.800        33.38
SET       2.900        35.76
SET       3.000        37.91
SET       3.100        40.07
SET       3.200        41.81
SET       3.300        43.49
SET       3.400        45.06
SET       3.500        46.43
SET       3.600        47.80
SET       3.700        49.18
SET       3.800        50.64
SET       3.900        52.11
SET       4.000        53.51
SET       4.100        54.71
SET       4.200        56.03
SET       4.300        57.16
SET       4.400        58.44
SET       4.500        59.64
SET       4.600        60.89
SET       4.700        62.02
SET       4.800        63.21
SET       4.900        64.36
SET       5.000        65.51
SET       5.100        66.65
SET       5.200        68.03
SET       5.300        69.33
SET       5.400        70.49
SET       5.500        71.80
SET       5.600        73.07
SET       5.700        74.30
SET       5.800        75.62
SET       5.900        76.97
SET       6.000        78.16
SET       6.100        79.57
SET       6.200        80.77
SET       6.300        81.88
SET       6.400        82.93
SET       6.500        84.10
SET       6.600        85.10
SET       6.700        85.98
SET       6.800        86.75
SET       6.900        87.43
SET       7.000        88.23
SET       7.100        88.75
SET       7.200        89.27
SET       7.300        89.76
SET       7.400        90.36
SET       7.500        90.79
SET       7.600        91.16
SET       7.700        91.53
SET       7.800        91.84
SET       7.900        92.16
SET       8.000        92.54
SET       8.100        92.87
SET       8.200        93.14
SET       8.300        93.39
SET       8.400        93.65
SET       8.500        93.86
SET       8.600        94.16
SET       8.700        94.39
SET       8.800        94.63
SET       8.900        94.91
SET       9.000        95.12
SET       9.100        95.29
SET       9.200        95.51
SET       9.300        95.72
SET       9.400        95.95
SET       9.500        96.07
SET       9.600        96.32
SET       9.700        96.46
SET       9.800        96.57
SET       9.900        96.72
SET      10.000        97.33
SET      11.000        98.11
SET      12.000        98.67
SET      13.000        99.00
SET      14.000        99.17
SET      15.000        99.36
SET      16.000        99.52
SET      17.000        99.62
SET      18.000        99.75
SET      19.000        99.80
SET      20.000        99.84
SET      21.000        99.85
SET      22.000        99.86
SET      23.000        99.90
SET      24.000        99.90
SET      27.000        99.92
SET      28.000        99.92
SET      29.000        99.93
SET      30.000        99.94
SET      31.000        99.95
SET      32.000        99.96
SET      36.000        99.97
SET      38.000        99.97
SET      51.000        99.98
SET      56.000        99.99
SET      86.000        99.99
SET      98.000       100.00
---
GET       1.800         0.01
GET       1.900         0.10
GET       2.000         0.44
GET       2.100         1.23
GET       2.200         2.55
GET       2.300         4.79
GET       2.400         7.44
GET       2.500        10.84
GET       2.600        14.76
GET       2.700        18.93
GET       2.800        22.75
GET       2.900        26.21
GET       3.000        29.62
GET       3.100        32.82
GET       3.200        35.50
GET       3.300        38.08
GET       3.400        40.44
GET       3.500        42.33
GET       3.600        44.15
GET       3.700        45.77
GET       3.800        46.99
GET       3.900        48.48
GET       4.000        49.85
GET       4.100        51.15
GET       4.200        52.44
GET       4.300        53.56
GET       4.400        54.67
GET       4.500        55.64
GET       4.600        56.81
GET       4.700        57.94
GET       4.800        58.99
GET       4.900        60.25
GET       5.000        61.46
GET       5.100        62.71
GET       5.200        64.06
GET       5.300        65.33
GET       5.400        66.64
GET       5.500        67.87
GET       5.600        69.19
GET       5.700        70.44
GET       5.800        71.73
GET       5.900        72.91
GET       6.000        74.19
GET       6.100        75.36
GET       6.200        76.48
GET       6.300        77.77
GET       6.400        78.99
GET       6.500        80.29
GET       6.600        81.63
GET       6.700        82.84
GET       6.800        83.87
GET       6.900        84.96
GET       7.000        85.89
GET       7.100        86.69
GET       7.200        87.38
GET       7.300        88.03
GET       7.400        88.66
GET       7.500        89.32
GET       7.600        89.79
GET       7.700        90.29
GET       7.800        90.65
GET       7.900        91.06
GET       8.000        91.44
GET       8.100        91.80
GET       8.200        92.07
GET       8.300        92.38
GET       8.400        92.66
GET       8.500        92.92
GET       8.600        93.22
GET       8.700        93.48
GET       8.800        93.71
GET       8.900        93.95
GET       9.000        94.13
GET       9.100        94.33
GET       9.200        94.54
GET       9.300        94.73
GET       9.400        94.98
GET       9.500        95.18
GET       9.600        95.38
GET       9.700        95.58
GET       9.800        95.74
GET       9.900        95.95
GET      10.000        96.85
GET      11.000        97.82
GET      12.000        98.31
GET      13.000        98.66
GET      14.000        98.93
GET      15.000        99.11
GET      16.000        99.32
GET      17.000        99.44
GET      18.000        99.55
GET      19.000        99.62
GET      20.000        99.68
GET      21.000        99.72
GET      22.000        99.74
GET      23.000        99.76
GET      24.000        99.80
GET      25.000        99.81
GET      26.000        99.82
GET      27.000        99.85
GET      28.000        99.85
GET      29.000        99.86
GET      30.000        99.87
GET      31.000        99.88
GET      32.000        99.89
GET      33.000        99.90
GET      34.000        99.91
GET      36.000        99.91
GET      42.000        99.92
GET      44.000        99.93
GET      45.000        99.94
GET      46.000        99.95
GET      52.000        99.95
GET      53.000        99.96
GET      56.000        99.97
GET      60.000        99.97
GET      64.000        99.98
GET      76.000        99.98
GET      89.000        99.99
GET      90.000        99.99
GET      96.000       100.00
---